export const TIPS = {
    offsetTop:
        '<b>offsetTop</b> – расстояние по оси Y от верхнего левого угла элемента до верхней внутренней границы <b>offsetParent</b>. <br /> <br /> <b>offsetParent</b> – ближайший CSS-позиционированный родитель или ближайший td, th, table, body.',
    offsetLeft:
        '<b>offsetLeft</b> – расстояние по оси X от верхнего левого угла элемента до левой внутренней границы <b>offsetParent</b>.  <br /> <br /> <b>offsetParent</b> – ближайший CSS-позиционированный родитель или ближайший td, th, table, body.',
    clientTop: '<b>clientTop</b> – расстояние от верхнего левого внешнего угла до внутренного по оси Y.',
    clientLeft: '<b>clientLeft</b> – расстояние от верхнего левого внешнего угла до внутренного по оси X. <b>clientLeft</b> включает в себя ширину полосы прокрутки для RTL (справа налево).',
    clientWidth: '<b>clientWidth</b> – ширина содержимого вместе с внутренними отступами padding, но без полосы прокрутки.',
    clientHeight: '<b>clientHeight</b> – высота содержимого вместе с внутренними отступами padding, но без полосы прокрутки.',
    offsetWidth: '<b>offsetWidth</b> – «внешняя» ширина элемента, включая рамки.',
    offsetHeight: '<b>offsetHeight</b> – «внешняя» высота элемента, включая рамки.',
    scrollTop: '<b>scrollTop</b> – высота прокрученной сверху части элемента, считается от верхнего левого угла.',
    scrollHeight: '<b>scrollHeight</b> – полная внутренняя высота контент окна, включая прокрученную область.',
};
